# RebarShapeParameters Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeParameters Class
Members See Also
---
Class containing functions that create and retrieve shared parameters for RebarShapes.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeParameters : IDisposable
```

Visual Basic
---
```text
Public Class RebarShapeParameters _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarShapeParameters : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeParameters
# See Also
RebarShapeParameters Members
Autodesk.Revit.DB.Structure Namespace